import React, { Component } from 'react';
import { Chart, Geom, Axis, Tooltip, Coord, Legend, Label } from "bizcharts";
import DataSet from "@antv/data-set";
import {Card} from 'antd';
import NoData from '../../NoData/NoDataComponent';
import DownLoad from '../../DownLoad';

let ds;

class BarChart extends Component {

    constructor(props) {
        super(props);
        this.state = {
            data: [],
			height: 0,
			chartIns: null,
        }
    }

    getData = () => {
        let dataList = [{
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 0.0,
			"电子设备": 0.0,
			"collegeName": "徐州工程学院",
			"机电设备": 0.0,
			"仪器仪表": 0.0,
			"印刷机械": 0.0,
			"total": 0.0,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 6.76,
			"电子设备": 7.52,
			"collegeName": "党委办公室",
			"机电设备": 0.0,
			"仪器仪表": 0.58,
			"印刷机械": 3.63,
			"total": 19.06,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.57
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 4.77,
			"电子设备": 10.73,
			"collegeName": "纪委办公室（监察处）",
			"仪器仪表": 1.7,
			"机电设备": 0.0,
			"印刷机械": 0.59,
			"total": 17.84,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.05
		}, {
			"图书": 1.09,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 4.83,
			"电子设备": 13.44,
			"collegeName": "党委组织部",
			"仪器仪表": 1.25,
			"机电设备": 0.0,
			"印刷机械": 3.59,
			"total": 24.33,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.13
		}, {
			"图书": 0.93,
			"文物及陈列品": 12.68,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 5.87,
			"电子设备": 82.36,
			"collegeName": "党委宣传部（党校、校报编辑部、新闻中心）",
			"机电设备": 0.9,
			"仪器仪表": 21.39,
			"印刷机械": 0.82,
			"total": 125.11,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.16
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 3.19,
			"电子设备": 1.83,
			"collegeName": "党委统战部",
			"机电设备": 0.0,
			"仪器仪表": 0.0,
			"印刷机械": 0.5,
			"total": 5.52,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 1.99,
			"电子设备": 1.65,
			"collegeName": "机关党委",
			"仪器仪表": 0.0,
			"机电设备": 0.0,
			"印刷机械": 0.48,
			"total": 4.12,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.48,
			"文物及陈列品": 2.55,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 74.26,
			"电子设备": 162.46,
			"collegeName": "院长办公室",
			"仪器仪表": 20.13,
			"机电设备": 160.07,
			"印刷机械": 7.56,
			"total": 433.28,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 5.77
		}, {
			"图书": 6.15,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 17.04,
			"电子设备": 166.89,
			"collegeName": "教务处（教师教学发展中心）",
			"机电设备": 1.05,
			"仪器仪表": 12.59,
			"印刷机械": 2.77,
			"total": 207.41,
			"工具、量具和器具": 0.0,
			"文体设备": 0.75,
			"标本模型": 0.0,
			"行政办公设备": 0.17
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 11.14,
			"电子设备": 15.46,
			"collegeName": "人事处（师资办公室）",
			"仪器仪表": 1.01,
			"机电设备": 1.16,
			"印刷机械": 0.84,
			"total": 29.61,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 16.32,
			"电子设备": 112.88,
			"collegeName": "财务处",
			"仪器仪表": 7.76,
			"机电设备": 1.13,
			"印刷机械": 3.77,
			"total": 155.25,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 13.39
		}, {
			"图书": 2.46,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 1.28,
			"被服装具": 0.0,
			"家具": 3218.68,
			"电子设备": 88.92,
			"collegeName": "党委学生工作部（学生处、人武部）",
			"机电设备": 21.59,
			"仪器仪表": 11.33,
			"印刷机械": 2.47,
			"total": 3348.88,
			"工具、量具和器具": 0.0,
			"文体设备": 0.68,
			"标本模型": 0.1,
			"行政办公设备": 1.37
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 13.17,
			"电子设备": 233.72,
			"collegeName": "党委保卫部（保卫处）",
			"仪器仪表": 20.7,
			"机电设备": 6.05,
			"印刷机械": 0.23,
			"total": 278.09,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 4.22
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 3.81,
			"电子设备": 10.9,
			"collegeName": "审计处",
			"仪器仪表": 1.61,
			"机电设备": 0.0,
			"印刷机械": 0.0,
			"total": 16.32,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 1.16,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 24.02,
			"电子设备": 33.87,
			"collegeName": "科研处（社科处、学科建设与研究生管理处）",
			"机电设备": 0.0,
			"仪器仪表": 44.21,
			"印刷机械": 0.84,
			"total": 104.1,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 8.2,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 2.35,
			"电子设备": 8.34,
			"collegeName": "产业处、大学科技园管理办公室",
			"仪器仪表": 2.39,
			"机电设备": 0.0,
			"印刷机械": 0.62,
			"total": 21.9,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 11.67,
			"电子设备": 43.78,
			"collegeName": "招生就业处",
			"仪器仪表": 4.49,
			"机电设备": 1.99,
			"印刷机械": 3.48,
			"total": 65.8,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.39
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 145.83,
			"被服装具": 61.46,
			"家具": 1594.71,
			"电子设备": 1188.82,
			"collegeName": "后勤管理处",
			"机电设备": 595.95,
			"仪器仪表": 19.63,
			"印刷机械": 2.76,
			"total": 3952.55,
			"工具、量具和器具": 0.0,
			"文体设备": 10.96,
			"标本模型": 0.0,
			"行政办公设备": 332.43
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 17.06,
			"电子设备": 18.44,
			"collegeName": "基建处",
			"仪器仪表": 4.13,
			"机电设备": 7.24,
			"印刷机械": 1.54,
			"total": 49.34,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.93
		}, {
			"图书": 67.52,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 8.08,
			"电子设备": 74.46,
			"collegeName": "实训实验室与设备管理处",
			"仪器仪表": 25.23,
			"机电设备": 0.66,
			"印刷机械": 2.71,
			"total": 178.66,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.02,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 7.55,
			"电子设备": 25.85,
			"collegeName": "国有资产管理处（招投标办公室）",
			"仪器仪表": 0.45,
			"机电设备": 0.0,
			"印刷机械": 0.58,
			"total": 35.18,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.73
		}, {
			"图书": 0.54,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 1.46,
			"电子设备": 4.0,
			"collegeName": "发展规划处",
			"机电设备": 0.0,
			"仪器仪表": 0.0,
			"印刷机械": 0.0,
			"total": 6.0,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 70.21,
			"电子设备": 20.08,
			"collegeName": "国际交流合作处（国际交流学院）",
			"仪器仪表": 3.4,
			"机电设备": 24.1,
			"印刷机械": 1.16,
			"total": 132.5,
			"工具、量具和器具": 0.0,
			"文体设备": 0.69,
			"标本模型": 0.0,
			"行政办公设备": 12.86
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 3.23,
			"电子设备": 5.34,
			"collegeName": "离退休干部工作处",
			"仪器仪表": 0.74,
			"机电设备": 1.35,
			"印刷机械": 0.46,
			"total": 11.7,
			"工具、量具和器具": 0.0,
			"文体设备": 0.44,
			"标本模型": 0.0,
			"行政办公设备": 0.14
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.39,
			"被服装具": 0.0,
			"家具": 3.88,
			"电子设备": 4.88,
			"collegeName": "工  会",
			"机电设备": 0.18,
			"仪器仪表": 2.66,
			"印刷机械": 0.24,
			"total": 21.0,
			"工具、量具和器具": 0.0,
			"文体设备": 6.85,
			"标本模型": 0.0,
			"行政办公设备": 1.92
		}, {
			"图书": 0.23,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 4.8,
			"电子设备": 92.14,
			"collegeName": "团  委",
			"仪器仪表": 11.12,
			"机电设备": 8.59,
			"印刷机械": 0.14,
			"total": 149.46,
			"工具、量具和器具": 0.0,
			"文体设备": 32.44,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.14,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 10.02,
			"电子设备": 23.43,
			"collegeName": "学报编辑部",
			"仪器仪表": 0.72,
			"机电设备": 0.0,
			"印刷机械": 0.89,
			"total": 35.2,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.09,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 6.28,
			"电子设备": 34.75,
			"collegeName": "高教研究与评估中心",
			"机电设备": 0.0,
			"仪器仪表": 1.48,
			"印刷机械": 1.62,
			"total": 44.22,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.09,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.22,
			"家具": 15.05,
			"电子设备": 2592.33,
			"collegeName": "信息化中心",
			"仪器仪表": 457.27,
			"机电设备": 16.15,
			"印刷机械": 0.43,
			"total": 3090.02,
			"工具、量具和器具": 0.19,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 8.29
		}, {
			"图书": 5191.84,
			"文物及陈列品": 1.14,
			"卫生医疗器械": 0.0,
			"被服装具": 0.03,
			"家具": 797.07,
			"电子设备": 768.41,
			"collegeName": "图书馆",
			"仪器仪表": 166.02,
			"机电设备": 31.86,
			"印刷机械": 7.86,
			"total": 6975.69,
			"工具、量具和器具": 0.0,
			"文体设备": 0.52,
			"标本模型": 0.0,
			"行政办公设备": 10.94
		}, {
			"图书": 2.2,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 32.13,
			"电子设备": 465.34,
			"collegeName": "经济学院",
			"机电设备": 16.02,
			"仪器仪表": 11.52,
			"印刷机械": 1.78,
			"total": 529.24,
			"工具、量具和器具": 0.15,
			"文体设备": 0.1,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 2.12,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 46.62,
			"电子设备": 184.82,
			"collegeName": "教育科学学院（教师教育学院）",
			"仪器仪表": 33.33,
			"机电设备": 10.09,
			"印刷机械": 2.33,
			"total": 293.75,
			"工具、量具和器具": 0.77,
			"文体设备": 6.13,
			"标本模型": 7.54,
			"行政办公设备": 0.0
		}, {
			"图书": 3.1,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 136.48,
			"被服装具": 0.0,
			"家具": 30.97,
			"电子设备": 72.23,
			"collegeName": "体育学院",
			"仪器仪表": 81.07,
			"机电设备": 16.91,
			"印刷机械": 0.89,
			"total": 500.08,
			"工具、量具和器具": 0.0,
			"文体设备": 155.44,
			"标本模型": 2.99,
			"行政办公设备": 0.0
		}, {
			"图书": 15.61,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 44.75,
			"电子设备": 304.23,
			"collegeName": "人文学院",
			"机电设备": 7.9,
			"仪器仪表": 82.26,
			"印刷机械": 1.32,
			"total": 457.62,
			"工具、量具和器具": 0.0,
			"文体设备": 1.55,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 101.76,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 1.94,
			"家具": 36.32,
			"电子设备": 491.9,
			"collegeName": "外国语学院",
			"仪器仪表": 9.59,
			"机电设备": 1.82,
			"印刷机械": 3.58,
			"total": 647.22,
			"工具、量具和器具": 0.0,
			"文体设备": 0.31,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.84,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.87,
			"被服装具": 0.0,
			"家具": 94.85,
			"电子设备": 349.71,
			"collegeName": "艺术学院",
			"仪器仪表": 177.95,
			"机电设备": 204.91,
			"印刷机械": 93.13,
			"total": 1073.4,
			"工具、量具和器具": 8.68,
			"文体设备": 129.53,
			"标本模型": 12.93,
			"行政办公设备": 0.0
		}, {
			"图书": 39.9,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 2.4,
			"被服装具": 0.2,
			"家具": 99.9,
			"电子设备": 284.78,
			"collegeName": "数学与物理科学学院",
			"仪器仪表": 815.89,
			"机电设备": 46.31,
			"印刷机械": 2.19,
			"total": 1305.16,
			"工具、量具和器具": 0.16,
			"文体设备": 13.43,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 32.15,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.9,
			"被服装具": 0.0,
			"家具": 120.24,
			"电子设备": 108.12,
			"collegeName": "化学化工学院",
			"机电设备": 213.23,
			"仪器仪表": 903.77,
			"印刷机械": 1.99,
			"total": 1446.19,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 5.66,
			"行政办公设备": 60.13
		}, {
			"图书": 1.79,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 18.2,
			"被服装具": 0.0,
			"家具": 112.24,
			"电子设备": 1661.89,
			"collegeName": "信电工程学院",
			"仪器仪表": 838.09,
			"机电设备": 109.26,
			"印刷机械": 2.34,
			"total": 2748.86,
			"工具、量具和器具": 0.0,
			"文体设备": 4.43,
			"标本模型": 0.0,
			"行政办公设备": 0.62
		}, {
			"图书": 2.15,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 20.8,
			"被服装具": 0.0,
			"家具": 82.59,
			"电子设备": 320.61,
			"collegeName": "机电工程学院",
			"仪器仪表": 1493.23,
			"机电设备": 832.82,
			"印刷机械": 8.13,
			"total": 2836.53,
			"工具、量具和器具": 38.19,
			"文体设备": 0.0,
			"标本模型": 37.9,
			"行政办公设备": 0.11
		}, {
			"图书": 1.03,
			"文物及陈列品": 22.17,
			"卫生医疗器械": 4.1,
			"被服装具": 0.0,
			"家具": 58.85,
			"电子设备": 402.03,
			"collegeName": "土木工程学院",
			"机电设备": 92.82,
			"仪器仪表": 1192.56,
			"印刷机械": 4.56,
			"total": 1801.2,
			"工具、量具和器具": 4.13,
			"文体设备": 0.91,
			"标本模型": 17.52,
			"行政办公设备": 0.52
		}, {
			"图书": 0.14,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 1.76,
			"被服装具": 0.0,
			"家具": 103.11,
			"电子设备": 74.51,
			"collegeName": "环境工程学院",
			"仪器仪表": 984.69,
			"机电设备": 184.47,
			"印刷机械": 5.25,
			"total": 1377.57,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 20.71,
			"行政办公设备": 2.93
		}, {
			"图书": 0.42,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 10.09,
			"被服装具": 0.0,
			"家具": 102.41,
			"电子设备": 129.56,
			"collegeName": "食品（生物）工程学院",
			"仪器仪表": 1905.16,
			"机电设备": 600.44,
			"印刷机械": 11.11,
			"total": 2802.29,
			"工具、量具和器具": 3.4,
			"文体设备": 0.49,
			"标本模型": 13.09,
			"行政办公设备": 26.12
		}, {
			"图书": 308.99,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 1.2,
			"家具": 88.59,
			"电子设备": 793.56,
			"collegeName": "管理学院",
			"机电设备": 56.97,
			"仪器仪表": 65.1,
			"印刷机械": 2.48,
			"total": 1342.21,
			"工具、量具和器具": 0.0,
			"文体设备": 1.71,
			"标本模型": 19.3,
			"行政办公设备": 4.31
		}, {
			"图书": 6.78,
			"文物及陈列品": 9.09,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 21.88,
			"电子设备": 19.81,
			"collegeName": "马克思主义学院",
			"仪器仪表": 1.98,
			"机电设备": 0.53,
			"印刷机械": 0.41,
			"total": 60.62,
			"工具、量具和器具": 0.0,
			"文体设备": 0.14,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}, {
			"图书": 0.06,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 31.31,
			"电子设备": 88.46,
			"collegeName": "继续教育学院",
			"仪器仪表": 12.06,
			"机电设备": 13.76,
			"印刷机械": 4.05,
			"total": 149.84,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.14
		}, {
			"图书": 0.59,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 9.36,
			"电子设备": 90.83,
			"collegeName": "徐州创新创业教育学院",
			"机电设备": 0.0,
			"仪器仪表": 8.03,
			"印刷机械": 1.28,
			"total": 111.45,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 1.36
		}, {
			"图书": 0.0,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 19.98,
			"电子设备": 11.76,
			"collegeName": "徐州工程学院大学科技园有限公司",
			"仪器仪表": 2.08,
			"机电设备": 48.03,
			"印刷机械": 0.22,
			"total": 82.57,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.5
		}, {
			"图书": 0.06,
			"文物及陈列品": 0.0,
			"卫生医疗器械": 0.0,
			"被服装具": 0.0,
			"家具": 45.19,
			"电子设备": 15.69,
			"collegeName": "档案馆",
			"仪器仪表": 0.85,
			"机电设备": 0.58,
			"印刷机械": 1.72,
			"total": 64.09,
			"工具、量具和器具": 0.0,
			"文体设备": 0.0,
			"标本模型": 0.0,
			"行政办公设备": 0.0
		}]
        // let fields = ["仪器仪表", "机电设备", "电子设备", "印刷机械", "卫生医疗器械", "文体设备", "标本模型", "文物及陈列品", "图书", "工具、量具和器具", "家具", "行政办公设备", "被服装具"]

        let newData = [];
        dataList.forEach(
            (item) => {
                newData.push({
                    name: item.collegeName,
                    "仪器仪表": item['仪器仪表'],
                    "卫生医疗器械": item['卫生医疗器械'],
                    "印刷机械": item['印刷机械'],
                    "图书": item['图书'],
                    "家具": item['家具'],
                    "工具、量具和器具": item['工具、量具和器具'],
                    // "房屋及构筑物": item['房屋及构筑物'],
                    "文体设备": item['文体设备'],
                    "文物及陈列品": item['文物及陈列品'],
                    "机电设备": item['机电设备'],
                    "标本模型": item['标本模型'],
                    "电子设备": item['电子设备'],
                    "行政办公设备": item['行政办公设备'],
                    "被服装具": item['被服装具'],
                    total: item.total,
                }) 
            }
        )
        this.setState({
            data: newData,
            height: newData.length*40
        })
    }

    componentDidMount() {
        this.getData()
    }

    render() {

        const height = this.state.height || 350; // 高度设置，默认值
        const label = {
            offset: 10, // 数值，设置坐标轴文本 label 距离坐标轴线的距离
            textStyle: {
                textAlign: 'end', // 文本对齐方向，可取值为： start center end
            },
            formatter (text, item, index) {
                return text
            }
        }
        
        let fields = [],
			data = this.state.data,
            nameKey;
            
        if(data && data[0]) {
            nameKey = Object.keys(data[0])[0]; // 获取json第一个对象的第一个键名称
            // 获取json对象子节点除去第一个键的其他键字段集合
            // Object.keys(data[0]).forEach((item, index) => {
            // 	if(index !== 2) {
            // 		fields.push(item);
            // 	}
            // })
            Object.keys(data[0]).forEach((item, index) => {
                // console.log(index,"1111")
                if(index !== 0 && item !=='total') {
                    fields.push(item);
                    // console.log(item,"00000")
                }
            })
            // 分组图
            ds = new DataSet({
                state:{
                    start: 0,
                    end: data.length-1
                }
            }); // dateset数据集方法
            const dv = ds.createView().source(data); // 数据转换
            // 初始化参数
            dv.source(data).transform({
                type: 'fold',
                fields: fields,
                key: 'type',
                value: 'value'
            }).transform({
                type: 'filter',
                callback: obj => {
                    const name = obj.name;
                    let curIndex;
                    this.state.data.forEach(
                        (item, index) => {
                            if (item.name === name) {
                                curIndex = index
                            }
                        }
                    )
                    return curIndex <= ds.state.end && curIndex >= ds.state.start;
                }
            })

            return (
				<div id="daochuzhuzhuangtu">
					<Card
						title={
							<div>柱状图
								<p style={{color:"#ccc", fontSize: 12, fontWeight: 400}}>导出柱状图</p>
							</div>
						}
						extra={
							<DownLoad 
								downloadChart={{
									id: "daochuzhuzhuangtu",
									title: "叠状柱状图"
								}} 
							/>
						}
					>
						<Chart 
							height={this.state.height} 
							data={dv} 
							padding={[10, 50, 80, 260]} 
							onGetG2Instance={(chartIns) => { this.setState({ chartIns }) }}
							forceFit
						>
							{/* <span style={{float: "left"}}></span> */}
							<Legend />
							<Coord transpose />
							<Axis name={nameKey} label={label} />
							<Axis name="value" />
							<Tooltip />
							<Geom
								type="intervalStack"
								position={nameKey+"*value"}
								color={['type']}
							>
								<Label
									content={[nameKey + '*value*total', (nameKey, value,total) => total]}
									formatter={(text, item, index)=>{
										// text 为每条记录 x 属性的值
										// item 为映射后的每条数据记录，是一个对象，可以从里面获取你想要的数据信息
										// index 为每条记录的索引
										if(index>=data.length*12){
											return text
										}else{
											return ''
										}

									}}
								/>
							</Geom>
						</Chart>
					</Card>
				</div>
                
            );
        } else {
            // 无数据时
            return(<NoData height={height} data={'nodata'}/>);
        }
    }
}

export default BarChart;